#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-keycloak_dev/runs/run-CEjgD9jZyJV49DZQ

Waiting for the plan to start...

Terraform v0.15.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.keycloak_prod.module.onestopauth.module.client_mytestprojectname-133.keycloak_openid_client.this: Refreshing state... [id=2be20d1b-a9ce-4457-8088-a40e91d5b5e3]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_openid_client.this: Refreshing state... [id=9b1ca273-f6e9-4235-b041-7ebefcdb9df6]
module.keycloak_prod.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_openid_client.this: Refreshing state... [id=2e4371b8-4902-43dc-91fe-b49c92f9d023]
module.keycloak_prod.module.onestopauth.module.client_junmin-client.keycloak_openid_client.this: Refreshing state... [id=5136a69c-3c38-48fb-9152-21ea4df18774]
module.keycloak_prod.module.onestopauth.module.client_junmin-client-test-111.keycloak_openid_client.this: Refreshing state... [id=a5f525d6-edb0-46cb-9bef-6fe1124dc550]
module.keycloak_prod.module.onestopauth.module.client_jumintestclientclient-36.keycloak_openid_client.this: Refreshing state... [id=1c0ab676-c972-4423-8c77-89899fd76d86]
module.keycloak_prod.module.onestopauth.module.client_new-test.keycloak_openid_client.this: Refreshing state... [id=cae48eb7-9213-4e01-bd6c-3692ad9bb6dc]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_openid_client.this: Refreshing state... [id=abce86c3-e567-49c9-a686-15166896d404]
module.keycloak_prod.module.onestopauth.module.client_test-07-28-2021-1.keycloak_openid_client.this: Refreshing state... [id=9e9a40fb-d7bd-4d47-8537-c4731ac40b16]
module.keycloak_prod.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_openid_client.this: Refreshing state... [id=3920cdf6-3964-45fc-a699-0296be61371e]
module.keycloak_prod.module.onestopauth.module.client_junminclienttest-100-67.keycloak_openid_client.this: Refreshing state... [id=dc0e419a-4013-449c-915a-b0257de57b0a]
module.keycloak_prod.module.onestopauth.module.client_junmin-client-test-101.keycloak_openid_client.this: Refreshing state... [id=a0941c95-75b1-4e1f-8930-1bdc6f0f2799]
module.keycloak_prod.module.onestopauth.module.client_test-1.keycloak_openid_client.this: Refreshing state... [id=e471f8c2-3e60-47b1-b656-0b55af8aaf18]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_openid_client.this: Refreshing state... [id=cc085d03-62d8-440d-a832-7f5e59ecce9d]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_openid_client.this: Refreshing state... [id=09958608-ab93-4c5b-bc17-f2f124358361]
module.keycloak_prod.module.onestopauth.module.client_demo-1-38.keycloak_openid_client.this: Refreshing state... [id=62fbd862-35bd-4ab1-8d85-07fa6b368b87]
module.keycloak_prod.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_openid_client.this: Refreshing state... [id=6f376229-5b13-4c52-8696-786a64216dca]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_openid_client.this: Refreshing state... [id=247a3095-d39f-4ea6-a564-4b01ddd0c6b6]
module.keycloak_prod.module.onestopauth.module.client_test-7-28-2021-133.keycloak_openid_client.this: Refreshing state... [id=40c3a1b7-48ce-4bf4-80fc-bbaaa2fc8d88]
module.keycloak_prod.module.onestopauth.module.client_jon-test-3-35.keycloak_openid_client.this: Refreshing state... [id=b1896eb8-242c-4725-95d5-dcceae7cf7c8]
module.keycloak_prod.module.onestopauth.module.client_test-232.keycloak_openid_client.this: Refreshing state... [id=b0f22b23-fbfd-4348-87f0-b594d0a91734]
module.keycloak_prod.module.onestopauth.module.client_negajjangproject-1.keycloak_openid_client.this: Refreshing state... [id=1617ed1a-78a7-4646-80c8-ff71f2de1221]
module.keycloak_prod.module.onestopauth.module.client_testclient-10.keycloak_openid_client.this: Refreshing state... [id=6eed1485-6ff9-4fd0-a23c-c40fe8b4a293]
module.keycloak_prod.module.onestopauth.module.client_jon-test-1-235.keycloak_openid_client.this: Refreshing state... [id=144724bf-a760-4e52-b35d-bbc7704452c9]
module.keycloak_prod.module.onestopauth.module.client_test-07-29-2021-233.keycloak_openid_client.this: Refreshing state... [id=c367616a-c124-4ac5-a529-0eb115ad8e2a]
module.keycloak_prod.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5bc2c783-550e-44e4-aabc-6834a4fe7ad2]
module.keycloak_prod.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8407b7a5-b88c-4fd1-b965-047e91d9ff1d]
module.keycloak_prod.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b8e25338-6994-4880-bc01-fba251d191dc]
module.keycloak_prod.module.onestopauth.module.client_junmin-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c7ccf12a-8b5a-4e34-af77-e047ca7d9fa9]
module.keycloak_prod.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=dd00c54f-d028-484a-ab89-06083e4a949f]
module.keycloak_prod.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3a996ce2-2356-4646-bbe2-48420ae30757]
module.keycloak_prod.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c4de20fc-1333-4628-96f7-d919deb8eb01]
module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f01faa6a-3ed7-4ba9-997b-f0e700b4f298]
module.keycloak_prod.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a3d3295b-775a-491d-88c6-5c8ddf171244]
module.keycloak_prod.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ee73d50a-998b-4b2e-9647-fffa19aa1843]
module.keycloak_prod.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=fdf4062e-f9f7-43d0-8285-9067d08d16d1]
module.keycloak_prod.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=188902ed-1a01-4c05-857f-0542d0aaa6a8]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=70f7709f-d718-47dd-afdf-6216c388aab0]
module.keycloak_prod.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=78e45507-25cc-49b3-9e47-a834ce647b62]
module.keycloak_prod.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=62c33ff0-61c5-478f-bcff-60cc6b08bf46]
module.keycloak_prod.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f2cce535-aad8-4375-82e1-19aa68086279]
module.keycloak_prod.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=520d73ff-bb76-4f59-b305-5d56736e39b1]
module.keycloak_prod.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=65c5629d-1fd4-466e-b370-f1eb66779591]
module.keycloak_prod.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=cbb41222-dcbc-4503-a86d-27a5d22bb19a]
module.keycloak_prod.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f1a2ff9b-88e0-47a6-8691-740d855287b9]
module.keycloak_prod.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=bcb39359-cbec-448b-9152-39c873d7e02f]
module.keycloak_prod.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7ed47957-f9a3-4a80-aab0-01faf7cf36f3]
module.keycloak_prod.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4e884a7c-bf32-4700-aa5a-92f89bab869e]
module.keycloak_prod.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=50f0aeaa-066a-4088-92a3-2802f4927808]
module.keycloak_prod.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=fed37d87-8fdf-4200-a90f-81d26dfbde09]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_openid_client.this: Refreshing state... [id=dfff478d-d39f-4cca-bac2-bef4e9227957]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-111.keycloak_openid_client.this: Refreshing state... [id=ff19fe9b-60cf-487a-ab64-c2a157151a34]
module.keycloak_test.module.onestopauth.module.client_test-232.keycloak_openid_client.this: Refreshing state... [id=e096156e-3356-44d4-ae3a-072efc791d42]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_openid_client.this: Refreshing state... [id=64bbade1-dc8a-4957-92b4-36ab257fe42c]
module.keycloak_test.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_openid_client.this: Refreshing state... [id=287219c4-8353-449e-9773-7545c7701e12]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_openid_client.this: Refreshing state... [id=e9fc90b5-cfc9-453e-aed4-b7ab01f27909]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_openid_client.this: Refreshing state... [id=76e15685-d331-4019-a81e-a15314052ccd]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_openid_client.this: Refreshing state... [id=9e3fe47f-31fc-472a-b7d5-d51abb224786]
module.keycloak_test.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_openid_client.this: Refreshing state... [id=8cb83bf3-95ea-4943-b7a1-7c3d7aa8f03a]
module.keycloak_test.module.onestopauth.module.client_jumintestclientclient-36.keycloak_openid_client.this: Refreshing state... [id=5768a49f-b17e-4244-a575-54ca541365f0]
module.keycloak_test.module.onestopauth.module.client_test-07-29-2021-233.keycloak_openid_client.this: Refreshing state... [id=5452a777-4056-4102-8259-6b83b16f4b22]
module.keycloak_test.module.onestopauth.module.client_mylastproject-166.keycloak_openid_client.this: Refreshing state... [id=47ff4035-c21c-4d5b-bf49-8039bdc01f39]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_openid_client.this: Refreshing state... [id=ca9ef106-21a5-45d2-bc20-625f320f50b5]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_openid_client.this: Refreshing state... [id=46002704-ba05-417f-acc7-677e1edecfa5]
module.keycloak_test.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_openid_client.this: Refreshing state... [id=ebea8df8-da8c-43f2-a4b1-e2b744ea9891]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-265.keycloak_openid_client.this: Refreshing state... [id=ca19cab7-cab4-4a70-ac56-f2f5bd581394]
module.keycloak_test.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_openid_client.this: Refreshing state... [id=1cf3d252-fc1e-44e3-86af-7c4c5eb85708]
module.keycloak_test.module.onestopauth.module.client_jon-test-3-35.keycloak_openid_client.this: Refreshing state... [id=9cb3e777-7c86-4096-9d2b-1c30d7f2894f]
module.keycloak_test.module.onestopauth.module.client_mytestprojectname-133.keycloak_openid_client.this: Refreshing state... [id=92d8350e-9fc7-4c05-a6e4-e3c82e660a71]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_openid_client.this: Refreshing state... [id=796dfdb0-673c-4cd7-ba6d-74a5cfd4634c]
module.keycloak_test.module.onestopauth.module.client_negajjangproject-1.keycloak_openid_client.this: Refreshing state... [id=354d18e4-7f65-4fd3-ac83-314cbbf74a95]
module.keycloak_test.module.onestopauth.module.client_junmin-client.keycloak_openid_client.this: Refreshing state... [id=2cb3e44a-2b76-4bd5-9733-8251d23f7eee]
module.keycloak_test.module.onestopauth.module.client_demo-1-38.keycloak_openid_client.this: Refreshing state... [id=32617156-670b-4fd4-a66f-cc5330d902ed]
module.keycloak_dev.module.onestopauth.module.client_negajjangproject-1.keycloak_openid_client.this: Refreshing state... [id=dc660770-a29c-443a-883b-bf710a38ba61]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-235.keycloak_openid_client.this: Refreshing state... [id=4c6746b4-6e7d-495e-9364-6ca3a9c27343]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_openid_client.this: Refreshing state... [id=0fc7a8d4-04c6-4337-87c7-3060685a478d]
module.keycloak_test.module.onestopauth.module.client_testclient-10.keycloak_openid_client.this: Refreshing state... [id=63ac5a96-4e81-4e80-aba7-79a0ea055972]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_openid_client.this: Refreshing state... [id=826a0452-3d49-4d51-a1b5-14d3b5457b02]
module.keycloak_dev.module.onestopauth.module.client_demo-1-38.keycloak_openid_client.this: Refreshing state... [id=3e92f2c1-b2b9-4ea0-96bf-04ba73b0b3db]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_openid_client.this: Refreshing state... [id=239347cb-49dc-43d2-9931-4420d7569d9b]
module.keycloak_dev.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_openid_client.this: Refreshing state... [id=f8596063-9e88-4941-b141-38ef42f6ba35]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_openid_client.this: Refreshing state... [id=ca184bbb-62e3-4ff9-81b6-6ac8f8007856]
module.keycloak_dev.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_openid_client.this: Refreshing state... [id=d99dd87f-39a0-44b6-9484-7f0c34d2aca9]
module.keycloak_dev.module.onestopauth.module.client_jon-test-3-35.keycloak_openid_client.this: Refreshing state... [id=ca2db14d-63a7-4ced-a98a-1295f9506bf7]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_openid_client.this: Refreshing state... [id=29c5d0d5-a078-4dd4-82f4-7a46fe58cd5d]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_openid_client.this: Refreshing state... [id=6396a962-3f95-4329-98cd-40eca50fd26c]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_openid_client.this: Refreshing state... [id=8c301040-2775-4c86-a033-3138786797e5]
module.keycloak_dev.module.onestopauth.module.client_test-1.keycloak_openid_client.this: Refreshing state... [id=e511063b-6500-4cd9-ab2f-32ae0c11c824]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_openid_client.this: Refreshing state... [id=4fb8f2ce-356d-485a-81f2-8f443107e047]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_openid_client.this: Refreshing state... [id=4dcec559-40d8-44ae-b584-e9cbd1262ea2]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_openid_client.this: Refreshing state... [id=5457c874-53e3-433d-b2ad-041f0c9983f7]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_openid_client.this: Refreshing state... [id=274cf2d2-c899-4f9d-bd0d-243698759c1d]
module.keycloak_dev.module.onestopauth.module.client_test-project.keycloak_openid_client.this: Refreshing state... [id=fc71bb86-0f87-441e-ab7e-bfe0ed5fadde]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_openid_client.this: Refreshing state... [id=ac0a4d90-c842-433b-842a-10bc92b264ee]
module.keycloak_dev.module.onestopauth.module.client_mytestprojectname-133.keycloak_openid_client.this: Refreshing state... [id=c7a8b2d3-5024-44fa-8dba-d69390e267a3]
module.keycloak_dev.module.onestopauth.module.client_junminclienttest-100-67.keycloak_openid_client.this: Refreshing state... [id=ec3697b9-97a3-4f29-bb4f-1e2de6d9f728]
module.keycloak_dev.module.onestopauth.module.client_junmin-client.keycloak_openid_client.this: Refreshing state... [id=78be11df-e5c5-4206-b8c0-ebec0b752127]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_openid_client.this: Refreshing state... [id=b8b65d6f-5bee-4047-9089-ca8d2cc0647e]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_openid_client.this: Refreshing state... [id=d720f7a2-356b-4c99-a7d4-54c691627185]
module.keycloak_dev.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_openid_client.this: Refreshing state... [id=d38e9f12-d8f6-4661-b99f-01b9990564e3]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_openid_client.this: Refreshing state... [id=5f9a016e-cd03-4432-b315-b331ee5075e0]
module.keycloak_dev.module.onestopauth.module.client_new-test.keycloak_openid_client.this: Refreshing state... [id=a148c1a3-803e-4b24-9fe1-3481ca4789fd]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ea55037b-e1ef-488a-a9bb-369203ac1e54]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b9dd5d14-ba60-4a92-9ee8-647cee399237]
module.keycloak_test.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=debb7946-5df9-4112-bd2a-59b7c7cdb676]
module.keycloak_test.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f2652350-2af4-42a6-bd34-5d728810eabc]
module.keycloak_test.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=cf7bdbd6-4d80-448e-964f-8130cdfd46d5]
module.keycloak_test.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=cf3cd2ae-a2fb-4c1b-8056-79059a5fbbd2]
module.keycloak_test.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=098aaf25-e9cf-4e19-9c80-d09f57439190]
module.keycloak_test.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b657f988-bbf6-4102-8282-52f4533f9a99]
module.keycloak_test.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=dc1ad8ba-bd95-4d43-a3e2-e88a13824167]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3e70028b-753a-4385-9398-a69ed65f20ac]
module.keycloak_test.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2bd5ed98-4fd8-47e1-8146-d45470cbf31e]
module.keycloak_test.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9b6f1b8f-e692-4023-b092-c3bcad8f575a]
module.keycloak_test.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=39bd98c2-f668-4ea4-a15c-d32916a6703a]
module.keycloak_test.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7a053e7d-eb39-4181-aa3c-bd345eb19f83]
module.keycloak_test.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6ede813c-99e2-4b57-b9a4-c5554786874f]
module.keycloak_test.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7bd5b16c-fefe-4e95-a641-0f75dc0c47a5]
module.keycloak_test.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f75de10b-e7c6-4ab7-94a4-4bf0d67e5ce9]
module.keycloak_test.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a87248ca-bb9a-4f23-9c64-7ee92548b9d0]
module.keycloak_test.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1727c957-7c0c-4568-8e15-2360a0a694b5]
module.keycloak_test.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=03975245-a356-4534-b7fb-9785adb765f5]
module.keycloak_test.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=64bcfa78-ab2f-4516-a330-dd3098274569]
module.keycloak_test.module.onestopauth.module.client_junmin-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=98034690-9a0c-4d19-ab1b-85f1ddbf491b]
module.keycloak_test.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d020fc9d-cbb5-4cfe-ada3-067a44254148]
module.keycloak_test.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4202b7e3-0ce7-437e-b083-3e3e41acb395]
module.keycloak_test.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b62befee-13bf-43d9-b574-a31ce9685301]
module.keycloak_dev.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=746702ff-4ae3-491f-8c36-e65545ae0c4a]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0761203a-2944-4aa8-ab11-1d0ae1d7f471]
module.keycloak_dev.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b2e14e97-3052-40d3-8fde-08835d204b00]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=09bf6d82-3a63-431c-8425-faf78176c2f3]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=55535ce7-35e1-41ed-a676-c4bd95901b73]
module.keycloak_dev.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b021dd34-f5ef-47b2-8e6f-ed1b7b0a9546]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=958158a6-eb69-4efd-b102-80265d62e24a]
module.keycloak_dev.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6bc8993e-01f2-4a2a-9aa8-dafd50675644]
module.keycloak_dev.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=90968149-1285-4050-959a-c52f6f9d014d]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=fdd1b368-149a-4755-899c-397f192c302d]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ad0f24f5-94ad-47d9-90a3-e9c280a6637b]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5776640a-5533-45d8-854a-261a866a39f6]
module.keycloak_dev.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0c81f44b-199f-4958-9041-7597f7acefd5]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a3dd3dbe-84af-41aa-aa94-15eb4d4d7dbb]
module.keycloak_dev.module.onestopauth.module.client_mylastproject-166.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=58107528-7fc6-441f-aef4-7f8fd52bbe3b]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2b0a92d5-c80d-405d-806d-395d38edf809]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c05e19d7-97f3-4bc6-bb4c-4ad1e55e33c1]
module.keycloak_dev.module.onestopauth.module.client_test-project.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=769933f1-95b5-4269-a036-65cf70088dd6]
module.keycloak_dev.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=96e3f864-4bc7-40ff-b35d-d4b6ca8776c2]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=723cc968-2a88-4e28-b0ac-c277498734c7]
module.keycloak_dev.module.onestopauth.module.client_junminclienttest-100-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=53091167-9140-484c-af51-53a4bcd5c6b1]
module.keycloak_dev.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=af70a806-df72-4c9f-a6c4-0cef832e279e]
module.keycloak_dev.module.onestopauth.module.client_junmin-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a02751f1-1c00-45a0-a61c-c39fa4f5c920]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-111.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1a060418-f9b1-4147-8cf9-b61026f5a7cd]
module.keycloak_dev.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=812c929b-2a36-4515-8347-23b3b02485c3]
module.keycloak_dev.module.onestopauth.module.client_new-test.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b215a15e-4ef3-4466-8238-da319ac5a1a4]
module.keycloak_dev.module.onestopauth.module.client_test-2-7-29-2021-234.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d7970cd4-68d1-481b-b688-ea7362911855]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_prod.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "abce86c3-e567-49c9-a686-15166896d404"
        name                                     = "test-1-07-30-2021-34"
      + web_origins                              = []
        # (13 unchanged attributes hidden)
    }
  # module.keycloak_dev.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "d99dd87f-39a0-44b6-9484-7f0c34d2aca9"
        name                                     = "test-1-07-30-2021-34"
      + web_origins                              = []
        # (13 unchanged attributes hidden)
    }
  # module.keycloak_test.module.onestopauth.module.client_test-1-07-30-2021-34.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "8cb83bf3-95ea-4943-b7a1-7c3d7aa8f03a"
        name                                     = "test-1-07-30-2021-34"
      + web_origins                              = []
        # (13 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_asdf-222222-eeeeee-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_asdf-222222-eeeeee-34.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "asdf-222222-eeeeee-34"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "asdf-222222-eeeeee-34"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:1000",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_asdf-222222-eeeeee-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_asdf-222222-eeeeee-34.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "asdf-222222-eeeeee-34"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "asdf-222222-eeeeee-34"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:1000",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_asdf-222222-eeeeee-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_asdf-222222-eeeeee-34.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "asdf-222222-eeeeee-34"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "asdf-222222-eeeeee-34"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:1000",
        ]
    }

Plan: 6 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 160 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*